NWPU-DanceRobotBase-RescueTeam/Explorer-Electronic/electric-code/STM32Cube/little_rescuer/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <string.h>
#include <math.h>
#include <stdio.h>

#include "adc.h"
#include "can.h"
#include "debug.h"
#include "fsm.h"
#include "Motor_Control.h"
#include "sensor.h"
#include "tim.h"
#include "usart.h"
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED0_Pin GPIO_PIN_13
#define LED0_GPIO_Port GPIOC
#define BUZZER_Pin GPIO_PIN_14
#define BUZZER_GPIO_Port GPIOC
#define HEADLIGHT_Pin GPIO_PIN_15
#define HEADLIGHT_GPIO_Port GPIOC
#define INFRARE_Pin GPIO_PIN_3
#define INFRARE_GPIO_Port GPIOC
#define Echo_Pin GPIO_PIN_0
#define Echo_GPIO_Port GPIOA
#define Echo_EXTI_IRQn EXTI0_IRQn
#define Trig_Pin GPIO_PIN_1
#define Trig_GPIO_Port GPIOA
#define M0_Pin GPIO_PIN_4
#define M0_GPIO_Port GPIOB
#define M1_Pin GPIO_PIN_5
#define M1_GPIO_Port GPIOB
#define LAMP_Pin GPIO_PIN_9
#define LAMP_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
